---
kind: method
id: M:Autodesk.Revit.DB.ExternalFileReference.GetReferencingId
source: html/1f0e36ac-506b-4b7e-5869-e13f982736ab.htm
---
# Autodesk.Revit.DB.ExternalFileReference.GetReferencingId Method

Gets the ElementId corresponding to the element which
 this ExternalFileReference is associated with.

## Syntax (C#)
```csharp
public ElementId GetReferencingId()
```